tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

writeCyclicMatch  false;

patches
(
    {
        name inlet;

        patchInfo
        {
            type patch;
        }

        constructFrom set;
        set inlet;
    }
    {
        name outlet;

        patchInfo
        {
            type patch;
        }

        constructFrom set;
        set outlet;
    }
);

// ************************************************************************* //
